###################################################################

# Created by write_sdc on Wed Jan 24 16:51:39 2018

###################################################################
set sdc_version 1.7

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 5 [get_ports {result0[63]}]
set_load -pin_load 5 [get_ports {result0[62]}]
set_load -pin_load 5 [get_ports {result0[61]}]
set_load -pin_load 5 [get_ports {result0[60]}]
set_load -pin_load 5 [get_ports {result0[59]}]
set_load -pin_load 5 [get_ports {result0[58]}]
set_load -pin_load 5 [get_ports {result0[57]}]
set_load -pin_load 5 [get_ports {result0[56]}]
set_load -pin_load 5 [get_ports {result0[55]}]
set_load -pin_load 5 [get_ports {result0[54]}]
set_load -pin_load 5 [get_ports {result0[53]}]
set_load -pin_load 5 [get_ports {result0[52]}]
set_load -pin_load 5 [get_ports {result0[51]}]
set_load -pin_load 5 [get_ports {result0[50]}]
set_load -pin_load 5 [get_ports {result0[49]}]
set_load -pin_load 5 [get_ports {result0[48]}]
set_load -pin_load 5 [get_ports {result0[47]}]
set_load -pin_load 5 [get_ports {result0[46]}]
set_load -pin_load 5 [get_ports {result0[45]}]
set_load -pin_load 5 [get_ports {result0[44]}]
set_load -pin_load 5 [get_ports {result0[43]}]
set_load -pin_load 5 [get_ports {result0[42]}]
set_load -pin_load 5 [get_ports {result0[41]}]
set_load -pin_load 5 [get_ports {result0[40]}]
set_load -pin_load 5 [get_ports {result0[39]}]
set_load -pin_load 5 [get_ports {result0[38]}]
set_load -pin_load 5 [get_ports {result0[37]}]
set_load -pin_load 5 [get_ports {result0[36]}]
set_load -pin_load 5 [get_ports {result0[35]}]
set_load -pin_load 5 [get_ports {result0[34]}]
set_load -pin_load 5 [get_ports {result0[33]}]
set_load -pin_load 5 [get_ports {result0[32]}]
set_load -pin_load 5 [get_ports {result0[31]}]
set_load -pin_load 5 [get_ports {result0[30]}]
set_load -pin_load 5 [get_ports {result0[29]}]
set_load -pin_load 5 [get_ports {result0[28]}]
set_load -pin_load 5 [get_ports {result0[27]}]
set_load -pin_load 5 [get_ports {result0[26]}]
set_load -pin_load 5 [get_ports {result0[25]}]
set_load -pin_load 5 [get_ports {result0[24]}]
set_load -pin_load 5 [get_ports {result0[23]}]
set_load -pin_load 5 [get_ports {result0[22]}]
set_load -pin_load 5 [get_ports {result0[21]}]
set_load -pin_load 5 [get_ports {result0[20]}]
set_load -pin_load 5 [get_ports {result0[19]}]
set_load -pin_load 5 [get_ports {result0[18]}]
set_load -pin_load 5 [get_ports {result0[17]}]
set_load -pin_load 5 [get_ports {result0[16]}]
set_load -pin_load 5 [get_ports {result0[15]}]
set_load -pin_load 5 [get_ports {result0[14]}]
set_load -pin_load 5 [get_ports {result0[13]}]
set_load -pin_load 5 [get_ports {result0[12]}]
set_load -pin_load 5 [get_ports {result0[11]}]
set_load -pin_load 5 [get_ports {result0[10]}]
set_load -pin_load 5 [get_ports {result0[9]}]
set_load -pin_load 5 [get_ports {result0[8]}]
set_load -pin_load 5 [get_ports {result0[7]}]
set_load -pin_load 5 [get_ports {result0[6]}]
set_load -pin_load 5 [get_ports {result0[5]}]
set_load -pin_load 5 [get_ports {result0[4]}]
set_load -pin_load 5 [get_ports {result0[3]}]
set_load -pin_load 5 [get_ports {result0[2]}]
set_load -pin_load 5 [get_ports {result0[1]}]
set_load -pin_load 5 [get_ports {result0[0]}]
set_load -pin_load 5 [get_ports {result1[63]}]
set_load -pin_load 5 [get_ports {result1[62]}]
set_load -pin_load 5 [get_ports {result1[61]}]
set_load -pin_load 5 [get_ports {result1[60]}]
set_load -pin_load 5 [get_ports {result1[59]}]
set_load -pin_load 5 [get_ports {result1[58]}]
set_load -pin_load 5 [get_ports {result1[57]}]
set_load -pin_load 5 [get_ports {result1[56]}]
set_load -pin_load 5 [get_ports {result1[55]}]
set_load -pin_load 5 [get_ports {result1[54]}]
set_load -pin_load 5 [get_ports {result1[53]}]
set_load -pin_load 5 [get_ports {result1[52]}]
set_load -pin_load 5 [get_ports {result1[51]}]
set_load -pin_load 5 [get_ports {result1[50]}]
set_load -pin_load 5 [get_ports {result1[49]}]
set_load -pin_load 5 [get_ports {result1[48]}]
set_load -pin_load 5 [get_ports {result1[47]}]
set_load -pin_load 5 [get_ports {result1[46]}]
set_load -pin_load 5 [get_ports {result1[45]}]
set_load -pin_load 5 [get_ports {result1[44]}]
set_load -pin_load 5 [get_ports {result1[43]}]
set_load -pin_load 5 [get_ports {result1[42]}]
set_load -pin_load 5 [get_ports {result1[41]}]
set_load -pin_load 5 [get_ports {result1[40]}]
set_load -pin_load 5 [get_ports {result1[39]}]
set_load -pin_load 5 [get_ports {result1[38]}]
set_load -pin_load 5 [get_ports {result1[37]}]
set_load -pin_load 5 [get_ports {result1[36]}]
set_load -pin_load 5 [get_ports {result1[35]}]
set_load -pin_load 5 [get_ports {result1[34]}]
set_load -pin_load 5 [get_ports {result1[33]}]
set_load -pin_load 5 [get_ports {result1[32]}]
set_load -pin_load 5 [get_ports {result1[31]}]
set_load -pin_load 5 [get_ports {result1[30]}]
set_load -pin_load 5 [get_ports {result1[29]}]
set_load -pin_load 5 [get_ports {result1[28]}]
set_load -pin_load 5 [get_ports {result1[27]}]
set_load -pin_load 5 [get_ports {result1[26]}]
set_load -pin_load 5 [get_ports {result1[25]}]
set_load -pin_load 5 [get_ports {result1[24]}]
set_load -pin_load 5 [get_ports {result1[23]}]
set_load -pin_load 5 [get_ports {result1[22]}]
set_load -pin_load 5 [get_ports {result1[21]}]
set_load -pin_load 5 [get_ports {result1[20]}]
set_load -pin_load 5 [get_ports {result1[19]}]
set_load -pin_load 5 [get_ports {result1[18]}]
set_load -pin_load 5 [get_ports {result1[17]}]
set_load -pin_load 5 [get_ports {result1[16]}]
set_load -pin_load 5 [get_ports {result1[15]}]
set_load -pin_load 5 [get_ports {result1[14]}]
set_load -pin_load 5 [get_ports {result1[13]}]
set_load -pin_load 5 [get_ports {result1[12]}]
set_load -pin_load 5 [get_ports {result1[11]}]
set_load -pin_load 5 [get_ports {result1[10]}]
set_load -pin_load 5 [get_ports {result1[9]}]
set_load -pin_load 5 [get_ports {result1[8]}]
set_load -pin_load 5 [get_ports {result1[7]}]
set_load -pin_load 5 [get_ports {result1[6]}]
set_load -pin_load 5 [get_ports {result1[5]}]
set_load -pin_load 5 [get_ports {result1[4]}]
set_load -pin_load 5 [get_ports {result1[3]}]
set_load -pin_load 5 [get_ports {result1[2]}]
set_load -pin_load 5 [get_ports {result1[1]}]
set_load -pin_load 5 [get_ports {result1[0]}]
set_load -pin_load 5 [get_ports {result2[63]}]
set_load -pin_load 5 [get_ports {result2[62]}]
set_load -pin_load 5 [get_ports {result2[61]}]
set_load -pin_load 5 [get_ports {result2[60]}]
set_load -pin_load 5 [get_ports {result2[59]}]
set_load -pin_load 5 [get_ports {result2[58]}]
set_load -pin_load 5 [get_ports {result2[57]}]
set_load -pin_load 5 [get_ports {result2[56]}]
set_load -pin_load 5 [get_ports {result2[55]}]
set_load -pin_load 5 [get_ports {result2[54]}]
set_load -pin_load 5 [get_ports {result2[53]}]
set_load -pin_load 5 [get_ports {result2[52]}]
set_load -pin_load 5 [get_ports {result2[51]}]
set_load -pin_load 5 [get_ports {result2[50]}]
set_load -pin_load 5 [get_ports {result2[49]}]
set_load -pin_load 5 [get_ports {result2[48]}]
set_load -pin_load 5 [get_ports {result2[47]}]
set_load -pin_load 5 [get_ports {result2[46]}]
set_load -pin_load 5 [get_ports {result2[45]}]
set_load -pin_load 5 [get_ports {result2[44]}]
set_load -pin_load 5 [get_ports {result2[43]}]
set_load -pin_load 5 [get_ports {result2[42]}]
set_load -pin_load 5 [get_ports {result2[41]}]
set_load -pin_load 5 [get_ports {result2[40]}]
set_load -pin_load 5 [get_ports {result2[39]}]
set_load -pin_load 5 [get_ports {result2[38]}]
set_load -pin_load 5 [get_ports {result2[37]}]
set_load -pin_load 5 [get_ports {result2[36]}]
set_load -pin_load 5 [get_ports {result2[35]}]
set_load -pin_load 5 [get_ports {result2[34]}]
set_load -pin_load 5 [get_ports {result2[33]}]
set_load -pin_load 5 [get_ports {result2[32]}]
set_load -pin_load 5 [get_ports {result2[31]}]
set_load -pin_load 5 [get_ports {result2[30]}]
set_load -pin_load 5 [get_ports {result2[29]}]
set_load -pin_load 5 [get_ports {result2[28]}]
set_load -pin_load 5 [get_ports {result2[27]}]
set_load -pin_load 5 [get_ports {result2[26]}]
set_load -pin_load 5 [get_ports {result2[25]}]
set_load -pin_load 5 [get_ports {result2[24]}]
set_load -pin_load 5 [get_ports {result2[23]}]
set_load -pin_load 5 [get_ports {result2[22]}]
set_load -pin_load 5 [get_ports {result2[21]}]
set_load -pin_load 5 [get_ports {result2[20]}]
set_load -pin_load 5 [get_ports {result2[19]}]
set_load -pin_load 5 [get_ports {result2[18]}]
set_load -pin_load 5 [get_ports {result2[17]}]
set_load -pin_load 5 [get_ports {result2[16]}]
set_load -pin_load 5 [get_ports {result2[15]}]
set_load -pin_load 5 [get_ports {result2[14]}]
set_load -pin_load 5 [get_ports {result2[13]}]
set_load -pin_load 5 [get_ports {result2[12]}]
set_load -pin_load 5 [get_ports {result2[11]}]
set_load -pin_load 5 [get_ports {result2[10]}]
set_load -pin_load 5 [get_ports {result2[9]}]
set_load -pin_load 5 [get_ports {result2[8]}]
set_load -pin_load 5 [get_ports {result2[7]}]
set_load -pin_load 5 [get_ports {result2[6]}]
set_load -pin_load 5 [get_ports {result2[5]}]
set_load -pin_load 5 [get_ports {result2[4]}]
set_load -pin_load 5 [get_ports {result2[3]}]
set_load -pin_load 5 [get_ports {result2[2]}]
set_load -pin_load 5 [get_ports {result2[1]}]
set_load -pin_load 5 [get_ports {result2[0]}]
set_load -pin_load 5 [get_ports {result3[63]}]
set_load -pin_load 5 [get_ports {result3[62]}]
set_load -pin_load 5 [get_ports {result3[61]}]
set_load -pin_load 5 [get_ports {result3[60]}]
set_load -pin_load 5 [get_ports {result3[59]}]
set_load -pin_load 5 [get_ports {result3[58]}]
set_load -pin_load 5 [get_ports {result3[57]}]
set_load -pin_load 5 [get_ports {result3[56]}]
set_load -pin_load 5 [get_ports {result3[55]}]
set_load -pin_load 5 [get_ports {result3[54]}]
set_load -pin_load 5 [get_ports {result3[53]}]
set_load -pin_load 5 [get_ports {result3[52]}]
set_load -pin_load 5 [get_ports {result3[51]}]
set_load -pin_load 5 [get_ports {result3[50]}]
set_load -pin_load 5 [get_ports {result3[49]}]
set_load -pin_load 5 [get_ports {result3[48]}]
set_load -pin_load 5 [get_ports {result3[47]}]
set_load -pin_load 5 [get_ports {result3[46]}]
set_load -pin_load 5 [get_ports {result3[45]}]
set_load -pin_load 5 [get_ports {result3[44]}]
set_load -pin_load 5 [get_ports {result3[43]}]
set_load -pin_load 5 [get_ports {result3[42]}]
set_load -pin_load 5 [get_ports {result3[41]}]
set_load -pin_load 5 [get_ports {result3[40]}]
set_load -pin_load 5 [get_ports {result3[39]}]
set_load -pin_load 5 [get_ports {result3[38]}]
set_load -pin_load 5 [get_ports {result3[37]}]
set_load -pin_load 5 [get_ports {result3[36]}]
set_load -pin_load 5 [get_ports {result3[35]}]
set_load -pin_load 5 [get_ports {result3[34]}]
set_load -pin_load 5 [get_ports {result3[33]}]
set_load -pin_load 5 [get_ports {result3[32]}]
set_load -pin_load 5 [get_ports {result3[31]}]
set_load -pin_load 5 [get_ports {result3[30]}]
set_load -pin_load 5 [get_ports {result3[29]}]
set_load -pin_load 5 [get_ports {result3[28]}]
set_load -pin_load 5 [get_ports {result3[27]}]
set_load -pin_load 5 [get_ports {result3[26]}]
set_load -pin_load 5 [get_ports {result3[25]}]
set_load -pin_load 5 [get_ports {result3[24]}]
set_load -pin_load 5 [get_ports {result3[23]}]
set_load -pin_load 5 [get_ports {result3[22]}]
set_load -pin_load 5 [get_ports {result3[21]}]
set_load -pin_load 5 [get_ports {result3[20]}]
set_load -pin_load 5 [get_ports {result3[19]}]
set_load -pin_load 5 [get_ports {result3[18]}]
set_load -pin_load 5 [get_ports {result3[17]}]
set_load -pin_load 5 [get_ports {result3[16]}]
set_load -pin_load 5 [get_ports {result3[15]}]
set_load -pin_load 5 [get_ports {result3[14]}]
set_load -pin_load 5 [get_ports {result3[13]}]
set_load -pin_load 5 [get_ports {result3[12]}]
set_load -pin_load 5 [get_ports {result3[11]}]
set_load -pin_load 5 [get_ports {result3[10]}]
set_load -pin_load 5 [get_ports {result3[9]}]
set_load -pin_load 5 [get_ports {result3[8]}]
set_load -pin_load 5 [get_ports {result3[7]}]
set_load -pin_load 5 [get_ports {result3[6]}]
set_load -pin_load 5 [get_ports {result3[5]}]
set_load -pin_load 5 [get_ports {result3[4]}]
set_load -pin_load 5 [get_ports {result3[3]}]
set_load -pin_load 5 [get_ports {result3[2]}]
set_load -pin_load 5 [get_ports {result3[1]}]
set_load -pin_load 5 [get_ports {result3[0]}]
create_clock [get_ports clk]  -name CLK  -period 5.5  -waveform {0 1.25}
set_max_delay 20  -from [get_ports resetn]
set_input_delay -clock CLK  -max 0.8  [get_ports clk]
set_input_delay -clock CLK  -max 0.8  [get_ports resetn]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[31]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[30]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[29]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[28]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[27]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[26]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[25]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[24]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[23]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[22]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[21]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[20]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[19]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[18]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[17]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[16]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a0[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[31]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[30]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[29]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[28]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[27]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[26]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[25]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[24]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[23]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[22]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[21]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[20]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[19]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[18]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[17]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[16]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b0[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[31]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[30]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[29]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[28]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[27]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[26]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[25]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[24]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[23]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[22]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[21]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[20]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[19]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[18]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[17]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[16]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a1[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[31]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[30]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[29]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[28]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[27]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[26]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[25]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[24]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[23]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[22]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[21]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[20]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[19]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[18]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[17]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[16]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b1[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[31]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[30]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[29]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[28]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[27]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[26]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[25]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[24]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[23]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[22]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[21]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[20]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[19]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[18]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[17]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[16]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a2[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[31]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[30]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[29]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[28]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[27]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[26]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[25]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[24]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[23]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[22]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[21]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[20]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[19]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[18]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[17]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[16]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b2[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[31]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[30]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[29]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[28]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[27]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[26]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[25]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[24]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[23]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[22]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[21]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[20]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[19]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[18]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[17]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[16]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {a3[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[31]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[30]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[29]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[28]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[27]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[26]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[25]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[24]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[23]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[22]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[21]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[20]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[19]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[18]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[17]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[16]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b3[0]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[63]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[62]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[61]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[60]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[59]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[58]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[57]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[56]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[55]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[54]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[53]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[52]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[51]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[50]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[49]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[48]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[47]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[46]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[45]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[44]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[43]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[42]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[41]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[40]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[39]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[38]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[37]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[36]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[35]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[34]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[33]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[32]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[31]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[30]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[29]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[28]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[27]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[26]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[25]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[24]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[23]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[22]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[21]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[20]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[19]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[18]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[17]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[16]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[15]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[14]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[13]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[12]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[11]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[10]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[9]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[8]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[7]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[6]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[5]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[4]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[3]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[2]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[1]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result0[0]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[63]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[62]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[61]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[60]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[59]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[58]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[57]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[56]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[55]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[54]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[53]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[52]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[51]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[50]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[49]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[48]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[47]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[46]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[45]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[44]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[43]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[42]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[41]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[40]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[39]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[38]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[37]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[36]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[35]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[34]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[33]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[32]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[31]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[30]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[29]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[28]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[27]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[26]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[25]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[24]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[23]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[22]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[21]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[20]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[19]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[18]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[17]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[16]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[15]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[14]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[13]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[12]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[11]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[10]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[9]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[8]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[7]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[6]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[5]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[4]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[3]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[2]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[1]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result1[0]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[63]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[62]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[61]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[60]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[59]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[58]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[57]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[56]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[55]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[54]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[53]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[52]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[51]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[50]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[49]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[48]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[47]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[46]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[45]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[44]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[43]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[42]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[41]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[40]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[39]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[38]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[37]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[36]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[35]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[34]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[33]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[32]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[31]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[30]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[29]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[28]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[27]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[26]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[25]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[24]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[23]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[22]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[21]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[20]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[19]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[18]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[17]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[16]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[15]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[14]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[13]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[12]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[11]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[10]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[9]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[8]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[7]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[6]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[5]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[4]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[3]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[2]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[1]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result2[0]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[63]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[62]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[61]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[60]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[59]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[58]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[57]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[56]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[55]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[54]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[53]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[52]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[51]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[50]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[49]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[48]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[47]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[46]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[45]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[44]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[43]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[42]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[41]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[40]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[39]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[38]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[37]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[36]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[35]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[34]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[33]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[32]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[31]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[30]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[29]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[28]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[27]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[26]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[25]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[24]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[23]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[22]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[21]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[20]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[19]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[18]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[17]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[16]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[15]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[14]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[13]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[12]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[11]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[10]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[9]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[8]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[7]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[6]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[5]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[4]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[3]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[2]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[1]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {result3[0]}]
set_input_transition -max 1  [get_ports {a0[31]}]
set_input_transition -max 1  [get_ports {a0[30]}]
set_input_transition -max 1  [get_ports {a0[29]}]
set_input_transition -max 1  [get_ports {a0[28]}]
set_input_transition -max 1  [get_ports {a0[27]}]
set_input_transition -max 1  [get_ports {a0[26]}]
set_input_transition -max 1  [get_ports {a0[25]}]
set_input_transition -max 1  [get_ports {a0[24]}]
set_input_transition -max 1  [get_ports {a0[23]}]
set_input_transition -max 1  [get_ports {a0[22]}]
set_input_transition -max 1  [get_ports {a0[21]}]
set_input_transition -max 1  [get_ports {a0[20]}]
set_input_transition -max 1  [get_ports {a0[19]}]
set_input_transition -max 1  [get_ports {a0[18]}]
set_input_transition -max 1  [get_ports {a0[17]}]
set_input_transition -max 1  [get_ports {a0[16]}]
set_input_transition -max 1  [get_ports {a0[15]}]
set_input_transition -max 1  [get_ports {a0[14]}]
set_input_transition -max 1  [get_ports {a0[13]}]
set_input_transition -max 1  [get_ports {a0[12]}]
set_input_transition -max 1  [get_ports {a0[11]}]
set_input_transition -max 1  [get_ports {a0[10]}]
set_input_transition -max 1  [get_ports {a0[9]}]
set_input_transition -max 1  [get_ports {a0[8]}]
set_input_transition -max 1  [get_ports {a0[7]}]
set_input_transition -max 1  [get_ports {a0[6]}]
set_input_transition -max 1  [get_ports {a0[5]}]
set_input_transition -max 1  [get_ports {a0[4]}]
set_input_transition -max 1  [get_ports {a0[3]}]
set_input_transition -max 1  [get_ports {a0[2]}]
set_input_transition -max 1  [get_ports {a0[1]}]
set_input_transition -max 1  [get_ports {a0[0]}]
set_input_transition -max 1  [get_ports {b0[31]}]
set_input_transition -max 1  [get_ports {b0[30]}]
set_input_transition -max 1  [get_ports {b0[29]}]
set_input_transition -max 1  [get_ports {b0[28]}]
set_input_transition -max 1  [get_ports {b0[27]}]
set_input_transition -max 1  [get_ports {b0[26]}]
set_input_transition -max 1  [get_ports {b0[25]}]
set_input_transition -max 1  [get_ports {b0[24]}]
set_input_transition -max 1  [get_ports {b0[23]}]
set_input_transition -max 1  [get_ports {b0[22]}]
set_input_transition -max 1  [get_ports {b0[21]}]
set_input_transition -max 1  [get_ports {b0[20]}]
set_input_transition -max 1  [get_ports {b0[19]}]
set_input_transition -max 1  [get_ports {b0[18]}]
set_input_transition -max 1  [get_ports {b0[17]}]
set_input_transition -max 1  [get_ports {b0[16]}]
set_input_transition -max 1  [get_ports {b0[15]}]
set_input_transition -max 1  [get_ports {b0[14]}]
set_input_transition -max 1  [get_ports {b0[13]}]
set_input_transition -max 1  [get_ports {b0[12]}]
set_input_transition -max 1  [get_ports {b0[11]}]
set_input_transition -max 1  [get_ports {b0[10]}]
set_input_transition -max 1  [get_ports {b0[9]}]
set_input_transition -max 1  [get_ports {b0[8]}]
set_input_transition -max 1  [get_ports {b0[7]}]
set_input_transition -max 1  [get_ports {b0[6]}]
set_input_transition -max 1  [get_ports {b0[5]}]
set_input_transition -max 1  [get_ports {b0[4]}]
set_input_transition -max 1  [get_ports {b0[3]}]
set_input_transition -max 1  [get_ports {b0[2]}]
set_input_transition -max 1  [get_ports {b0[1]}]
set_input_transition -max 1  [get_ports {b0[0]}]
set_input_transition -max 1  [get_ports {a1[31]}]
set_input_transition -max 1  [get_ports {a1[30]}]
set_input_transition -max 1  [get_ports {a1[29]}]
set_input_transition -max 1  [get_ports {a1[28]}]
set_input_transition -max 1  [get_ports {a1[27]}]
set_input_transition -max 1  [get_ports {a1[26]}]
set_input_transition -max 1  [get_ports {a1[25]}]
set_input_transition -max 1  [get_ports {a1[24]}]
set_input_transition -max 1  [get_ports {a1[23]}]
set_input_transition -max 1  [get_ports {a1[22]}]
set_input_transition -max 1  [get_ports {a1[21]}]
set_input_transition -max 1  [get_ports {a1[20]}]
set_input_transition -max 1  [get_ports {a1[19]}]
set_input_transition -max 1  [get_ports {a1[18]}]
set_input_transition -max 1  [get_ports {a1[17]}]
set_input_transition -max 1  [get_ports {a1[16]}]
set_input_transition -max 1  [get_ports {a1[15]}]
set_input_transition -max 1  [get_ports {a1[14]}]
set_input_transition -max 1  [get_ports {a1[13]}]
set_input_transition -max 1  [get_ports {a1[12]}]
set_input_transition -max 1  [get_ports {a1[11]}]
set_input_transition -max 1  [get_ports {a1[10]}]
set_input_transition -max 1  [get_ports {a1[9]}]
set_input_transition -max 1  [get_ports {a1[8]}]
set_input_transition -max 1  [get_ports {a1[7]}]
set_input_transition -max 1  [get_ports {a1[6]}]
set_input_transition -max 1  [get_ports {a1[5]}]
set_input_transition -max 1  [get_ports {a1[4]}]
set_input_transition -max 1  [get_ports {a1[3]}]
set_input_transition -max 1  [get_ports {a1[2]}]
set_input_transition -max 1  [get_ports {a1[1]}]
set_input_transition -max 1  [get_ports {a1[0]}]
set_input_transition -max 1  [get_ports {b1[31]}]
set_input_transition -max 1  [get_ports {b1[30]}]
set_input_transition -max 1  [get_ports {b1[29]}]
set_input_transition -max 1  [get_ports {b1[28]}]
set_input_transition -max 1  [get_ports {b1[27]}]
set_input_transition -max 1  [get_ports {b1[26]}]
set_input_transition -max 1  [get_ports {b1[25]}]
set_input_transition -max 1  [get_ports {b1[24]}]
set_input_transition -max 1  [get_ports {b1[23]}]
set_input_transition -max 1  [get_ports {b1[22]}]
set_input_transition -max 1  [get_ports {b1[21]}]
set_input_transition -max 1  [get_ports {b1[20]}]
set_input_transition -max 1  [get_ports {b1[19]}]
set_input_transition -max 1  [get_ports {b1[18]}]
set_input_transition -max 1  [get_ports {b1[17]}]
set_input_transition -max 1  [get_ports {b1[16]}]
set_input_transition -max 1  [get_ports {b1[15]}]
set_input_transition -max 1  [get_ports {b1[14]}]
set_input_transition -max 1  [get_ports {b1[13]}]
set_input_transition -max 1  [get_ports {b1[12]}]
set_input_transition -max 1  [get_ports {b1[11]}]
set_input_transition -max 1  [get_ports {b1[10]}]
set_input_transition -max 1  [get_ports {b1[9]}]
set_input_transition -max 1  [get_ports {b1[8]}]
set_input_transition -max 1  [get_ports {b1[7]}]
set_input_transition -max 1  [get_ports {b1[6]}]
set_input_transition -max 1  [get_ports {b1[5]}]
set_input_transition -max 1  [get_ports {b1[4]}]
set_input_transition -max 1  [get_ports {b1[3]}]
set_input_transition -max 1  [get_ports {b1[2]}]
set_input_transition -max 1  [get_ports {b1[1]}]
set_input_transition -max 1  [get_ports {b1[0]}]
set_input_transition -max 1  [get_ports {a2[31]}]
set_input_transition -max 1  [get_ports {a2[30]}]
set_input_transition -max 1  [get_ports {a2[29]}]
set_input_transition -max 1  [get_ports {a2[28]}]
set_input_transition -max 1  [get_ports {a2[27]}]
set_input_transition -max 1  [get_ports {a2[26]}]
set_input_transition -max 1  [get_ports {a2[25]}]
set_input_transition -max 1  [get_ports {a2[24]}]
set_input_transition -max 1  [get_ports {a2[23]}]
set_input_transition -max 1  [get_ports {a2[22]}]
set_input_transition -max 1  [get_ports {a2[21]}]
set_input_transition -max 1  [get_ports {a2[20]}]
set_input_transition -max 1  [get_ports {a2[19]}]
set_input_transition -max 1  [get_ports {a2[18]}]
set_input_transition -max 1  [get_ports {a2[17]}]
set_input_transition -max 1  [get_ports {a2[16]}]
set_input_transition -max 1  [get_ports {a2[15]}]
set_input_transition -max 1  [get_ports {a2[14]}]
set_input_transition -max 1  [get_ports {a2[13]}]
set_input_transition -max 1  [get_ports {a2[12]}]
set_input_transition -max 1  [get_ports {a2[11]}]
set_input_transition -max 1  [get_ports {a2[10]}]
set_input_transition -max 1  [get_ports {a2[9]}]
set_input_transition -max 1  [get_ports {a2[8]}]
set_input_transition -max 1  [get_ports {a2[7]}]
set_input_transition -max 1  [get_ports {a2[6]}]
set_input_transition -max 1  [get_ports {a2[5]}]
set_input_transition -max 1  [get_ports {a2[4]}]
set_input_transition -max 1  [get_ports {a2[3]}]
set_input_transition -max 1  [get_ports {a2[2]}]
set_input_transition -max 1  [get_ports {a2[1]}]
set_input_transition -max 1  [get_ports {a2[0]}]
set_input_transition -max 1  [get_ports {b2[31]}]
set_input_transition -max 1  [get_ports {b2[30]}]
set_input_transition -max 1  [get_ports {b2[29]}]
set_input_transition -max 1  [get_ports {b2[28]}]
set_input_transition -max 1  [get_ports {b2[27]}]
set_input_transition -max 1  [get_ports {b2[26]}]
set_input_transition -max 1  [get_ports {b2[25]}]
set_input_transition -max 1  [get_ports {b2[24]}]
set_input_transition -max 1  [get_ports {b2[23]}]
set_input_transition -max 1  [get_ports {b2[22]}]
set_input_transition -max 1  [get_ports {b2[21]}]
set_input_transition -max 1  [get_ports {b2[20]}]
set_input_transition -max 1  [get_ports {b2[19]}]
set_input_transition -max 1  [get_ports {b2[18]}]
set_input_transition -max 1  [get_ports {b2[17]}]
set_input_transition -max 1  [get_ports {b2[16]}]
set_input_transition -max 1  [get_ports {b2[15]}]
set_input_transition -max 1  [get_ports {b2[14]}]
set_input_transition -max 1  [get_ports {b2[13]}]
set_input_transition -max 1  [get_ports {b2[12]}]
set_input_transition -max 1  [get_ports {b2[11]}]
set_input_transition -max 1  [get_ports {b2[10]}]
set_input_transition -max 1  [get_ports {b2[9]}]
set_input_transition -max 1  [get_ports {b2[8]}]
set_input_transition -max 1  [get_ports {b2[7]}]
set_input_transition -max 1  [get_ports {b2[6]}]
set_input_transition -max 1  [get_ports {b2[5]}]
set_input_transition -max 1  [get_ports {b2[4]}]
set_input_transition -max 1  [get_ports {b2[3]}]
set_input_transition -max 1  [get_ports {b2[2]}]
set_input_transition -max 1  [get_ports {b2[1]}]
set_input_transition -max 1  [get_ports {b2[0]}]
set_input_transition -max 1  [get_ports {a3[31]}]
set_input_transition -max 1  [get_ports {a3[30]}]
set_input_transition -max 1  [get_ports {a3[29]}]
set_input_transition -max 1  [get_ports {a3[28]}]
set_input_transition -max 1  [get_ports {a3[27]}]
set_input_transition -max 1  [get_ports {a3[26]}]
set_input_transition -max 1  [get_ports {a3[25]}]
set_input_transition -max 1  [get_ports {a3[24]}]
set_input_transition -max 1  [get_ports {a3[23]}]
set_input_transition -max 1  [get_ports {a3[22]}]
set_input_transition -max 1  [get_ports {a3[21]}]
set_input_transition -max 1  [get_ports {a3[20]}]
set_input_transition -max 1  [get_ports {a3[19]}]
set_input_transition -max 1  [get_ports {a3[18]}]
set_input_transition -max 1  [get_ports {a3[17]}]
set_input_transition -max 1  [get_ports {a3[16]}]
set_input_transition -max 1  [get_ports {a3[15]}]
set_input_transition -max 1  [get_ports {a3[14]}]
set_input_transition -max 1  [get_ports {a3[13]}]
set_input_transition -max 1  [get_ports {a3[12]}]
set_input_transition -max 1  [get_ports {a3[11]}]
set_input_transition -max 1  [get_ports {a3[10]}]
set_input_transition -max 1  [get_ports {a3[9]}]
set_input_transition -max 1  [get_ports {a3[8]}]
set_input_transition -max 1  [get_ports {a3[7]}]
set_input_transition -max 1  [get_ports {a3[6]}]
set_input_transition -max 1  [get_ports {a3[5]}]
set_input_transition -max 1  [get_ports {a3[4]}]
set_input_transition -max 1  [get_ports {a3[3]}]
set_input_transition -max 1  [get_ports {a3[2]}]
set_input_transition -max 1  [get_ports {a3[1]}]
set_input_transition -max 1  [get_ports {a3[0]}]
set_input_transition -max 1  [get_ports {b3[31]}]
set_input_transition -max 1  [get_ports {b3[30]}]
set_input_transition -max 1  [get_ports {b3[29]}]
set_input_transition -max 1  [get_ports {b3[28]}]
set_input_transition -max 1  [get_ports {b3[27]}]
set_input_transition -max 1  [get_ports {b3[26]}]
set_input_transition -max 1  [get_ports {b3[25]}]
set_input_transition -max 1  [get_ports {b3[24]}]
set_input_transition -max 1  [get_ports {b3[23]}]
set_input_transition -max 1  [get_ports {b3[22]}]
set_input_transition -max 1  [get_ports {b3[21]}]
set_input_transition -max 1  [get_ports {b3[20]}]
set_input_transition -max 1  [get_ports {b3[19]}]
set_input_transition -max 1  [get_ports {b3[18]}]
set_input_transition -max 1  [get_ports {b3[17]}]
set_input_transition -max 1  [get_ports {b3[16]}]
set_input_transition -max 1  [get_ports {b3[15]}]
set_input_transition -max 1  [get_ports {b3[14]}]
set_input_transition -max 1  [get_ports {b3[13]}]
set_input_transition -max 1  [get_ports {b3[12]}]
set_input_transition -max 1  [get_ports {b3[11]}]
set_input_transition -max 1  [get_ports {b3[10]}]
set_input_transition -max 1  [get_ports {b3[9]}]
set_input_transition -max 1  [get_ports {b3[8]}]
set_input_transition -max 1  [get_ports {b3[7]}]
set_input_transition -max 1  [get_ports {b3[6]}]
set_input_transition -max 1  [get_ports {b3[5]}]
set_input_transition -max 1  [get_ports {b3[4]}]
set_input_transition -max 1  [get_ports {b3[3]}]
set_input_transition -max 1  [get_ports {b3[2]}]
set_input_transition -max 1  [get_ports {b3[1]}]
set_input_transition -max 1  [get_ports {b3[0]}]
set_input_transition -max 1  [get_ports resetn]
set_input_transition -max 1  [get_ports clk]
